src/rtp_project2/LoadTest/CCLT1.yaml
---
#loadtest city cool
execution:
  scenario: citycool
  concurrency: 2
  ramp-up: 5s
  hold-for: 35s
scenarios:
  citycool:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.143 Safari/537.36'
      Accept-Encoding: 'gzip, deflate, sdch, br'
      Accept-Language: 'en-US,en;q=0.8'
    requests:
      - url: 'https://rtp-qa1-demo1.adm01.com/products/all.html'
        method: GET
        label: 'Product Page'
        headers:
          Upgrade-Insecure-Requests: '1'
          Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8'
      - url: 'https://rtp-qa1-xe.adm01.com/xe/execution-engine.min.js'
        method: GET
        label: 'execution engine JS1'
        headers:
          Accept: '*/*'
          Referer: 'https://rtp-qa1-demo1.adm01.com/products/all.html'
      - url: 'https://rtp-qa1-xe.adm01.com/xe/execution-engine.min.js'
        method: GET
        label: 'execution engine JS2'
        headers:
          Accept: '*/*'
          Referer: 'https://rtp-qa1-demo1.adm01.com/products/all.html'
      - url: 'https://rtp-qa1-api.adm01.com/rtp/YFXHIGyr8p4NU8mYtb_FaZ6GUYhbV0HDrtbE5d2cVbU='
        method: GET
        label: 'public API'
        headers:
          Origin: 'https://rtp-qa1-demo1.adm01.com'
          Accept: '*/*'
          Referer: 'https://rtp-qa1-demo1.adm01.com/products/all.html'
reporting:
    - module: blazemeter